using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;
using System.Web.Http;

namespace projectAngular.Models
{
    public class DB
    {
        public static List<User> U { get; set; } = new List<User>();
        public static List<Category> C { get; set; } = new List<Category>();
        public static List<Recipe> R { get; set; } = new List<Recipe>();

        static DB()
        {
            U.Add(new User()
            {
                Address = "gurlitz 11 netanya",
                CodeUser = 123,
                Email = "123@gmail.com",
                NameUser = "sara cohen",
                Password = "sara1"
            });
            U.Add(new User()
            {
                Address = "tarfon 13 netanya",
                CodeUser = 456,
                Email = "456@gmail.com",
                NameUser = "riki levi",
                Password = "321"
            });
            U.Add(new User()
            {
                Address = "bartenura 10 netanya",
                CodeUser = 789,
                Email = "789@gmail.com",
                NameUser = "efrat rubin",
                Password = "200153618"
            });

            C.Add(new Category()
            {
                CodeCategory = 1,
                NameCategory = "אוכל אסייתי",
                Nituv = "/assets/אסיאתי.jpg"
            });
            C.Add(new Category()
            {
                CodeCategory = 2,
                NameCategory = "אוכל איטלקי",
                Nituv = "/assets/איטלקי.jpg"
            });
            C.Add(new Category()
            {
                CodeCategory = 3,
                NameCategory = "אוכל ישראלי",
                Nituv = "ישראלי.jpg"
            });


            R.Add(new Recipe()
            {
                CodeCategory = 2,
                CodeRecipe = 1,
                CodeUser = 123,
                DateAddRecipe = new DateTime(08 / 12 / 2020),
                NameRecipe = "פיצטות חצילים וגבינות",
                Image = "/assets/פיצטות חצילים.jpg",
                ListComponent = new List<string>()
            {
                "לחצילים: 16 פרוסות בעובי סמ וחצי של חצילים מוארכים בקליפתם",
                "2 כפות שמן זית",
                "לרוטב: 2 כפות שמן זית",
                "2-1 שיני שום כתושות",
                "3 עגבניות בינוניות, חתוכות לקוביות בגודל 1 סמ",
                "1/4 כוס מים",
                "‏1/2 כפית סוכר",
                "1/2 כפית אורגנו מיובש",
                "מלח", "פלפל שחור גרוס",
                "לטופינג: 6 עלי בזיליקום, חתוכים לרצועות דקות",
                "1/2 שקית (150 גרם) מוצרלה מגורדת",
                "1/3 קופסה (70 גרם) קוביות בולגרית מעודנת 5%"
            }
            ,
                PrepartionM = new List<string>() {
            "מחממים תנור ל-190 מעלות ומרפדים תבנית בנייר אפייה.",
            "מכינים את החצילים: מניחים פרוסות חצילים בתבנית ומברישים בשמן זית.",
            "אופים 30-25 דקות להזהבה.",
            "בינתיים מכינים את הרוטב: מחממים מחבת גדולה על להבה בינונית, מוסיפים שמן זית ושום ומאדים כדקה רק עד שעולה ריח.",
            "מוסיפים עגבניות, מים וסוכר ומתבלים באורגנו, מלח ופלפל. מערבבים ומביאים לרתיחה. מנמיכים את הלהבה ומבשלים כ-15 דקות תוך כדי בחישה מדי פעם. טועמים ומתקנים תיבול. מצננים היטב. הרוטב נשמר עד 4 ימים בכלי אטום במקרר.",
            "מרכיבים את הפיצטות ואופים: מניחים על כל פרוסת חציל כף שטוחה של רוטב וכמה רצועות של בזיליקום. מפזרים מעל מוצרלה וקוביות של גבינה בולגרית.",
            "מגבירים את חום התנור ל-200 מעלות ואופים את הפיצטות כ-10 דקות, עד שהמוצרלה זהובה. מגישים חם."
            }
            ,
                LevelOfDifficul = 3,
                Time = 30
            });
            R.Add(new Recipe()
            {
                CodeCategory = 2,
                CodeRecipe = 2,
                CodeUser = 456,
                DateAddRecipe = new DateTime(06 / 12 / 2020),
                NameRecipe = "פסטה ברוטב שמנת פטריות",
                Image = "/assets/פסטה ברוטב שמנת.jpg",
                ListComponent = new List<string>()
                {
                    "חבילת פסטה – עדיף פנה",
                    "מים",
                    "1 חבילה שמנת",
                    "1 חבילת פטריות",
                    "1/4 כוס חלב",
                    "שמן זית",
                    "1 שן שום",
                    "מלח, פלפל"
                }
                ,
                PrepartionM = new List<string>()
                {
                    "מחמים שמן זית במחבת ומטגנים את הפטריות ואת השום",
                    "כעבור מספר דקות, לאחר שהפטריות נצלות, מוסיפים את השמנת והחלב. להוריד מהאש",
                    "מתבלים בעזרת מלח ופלפל לפי הטעם",
                    "בינתיים ניתן להכין את הפסטה לפי הוראות היצרן – לבשל במים רותחים ולסנן",
                    "את הרוטב מוסיפים על הפסטה – ניתן לבשל אותם קצת יחד"
                },
                LevelOfDifficul = 1,
                Time = 25,
                IfShow = true
            });
            R.Add(new Recipe()
            {
                CodeCategory = 2,
                CodeRecipe = 3,
                CodeUser = 789,
                DateAddRecipe = new DateTime(04 / 06 / 2019),
                NameRecipe = "ארנצ'יני - כדורי ריזוטו בציפוי פריך",
                Image = "/assets/ארנציני.jpg",
                ListComponent = new List<string>()
                {
                    "250 גרם אורז עגול איטלקי (ארבוריו מומלץ)",
                    "1 כף שמן זית",
                    "2 שיני שום קלופות ומעוכות",
                    "חצי כוס יין לבן",
                    "כוס וחצי ציר ירקות חם",
                    "50 גרם חמאה",
                    "50 גרם פקורינו",
                    "150 גרם בייבי מוצרלה",
                    "קמח, פרורי לחם וביצה לציפוי",
                    "שמן לטיגון עמוק",
                    "מלח"
                },
                PrepartionM = new List<string>()
                {
                    "מכינים את הריזוטו: מטגנים בשמן זית את השום עם חצי כפית מלח, מוסיפים את האורז לטיגון קל עד שהאורז מתחמם. מוסיפים יין לבן, ממשיכים לטגן עד אידוי ומתחילים להוסיף את ציר הירקות החם. ",
                    "מבשלים 18 דקות ומורידים מהאש.",
                    "מוסיפים את החמאה וגבינת הפקורינו תוך כדי ערבוב בתנועות קיפול, ומניחים בצד לצינון. ",
                    "מכינים את הארנצ'יני: כאשר הריזוטו קר, מכדררים את התערובת לכדורים בגודל של כדורי פינג פונג (כ-40 גרם, למי שיש משקל למטבח) ומכניסים לתוך כל אחד כדורון של בייבי מוצרלה.",
                    "מצפים בקמח, ביצה ופירורי לחם (לפי הסדר הרשום, ממש כמו שניצל) ומטגנים בשמן עמוק עד שהכדורים מזהיבים. מוטב לעשות זאת בנגלות. "
                }
             ,
                LevelOfDifficul = 4,
                Time = 90,
                IfShow = true
            });

            R.Add(new Recipe()
            {
                CodeCategory = 1,
                CodeRecipe = 4,
                CodeUser = 123,
                DateAddRecipe = new DateTime(17 / 08 / 2020),
                NameRecipe = "שוקי עוף ברוטב סויה ומיץ תפוזים",
                Image = "/assets/עוף אסייתי.jpg",
                ListComponent = new List<string>()
                {
                    "12 שוקי עוף",
                    "1/2 כוס רוטב סויה",
                    "1/2 כוס מיץ תפוזים",
                    "1/3 כוס דבש",
                    "1/2 כפית פלפל שחור גרוס",
                    "3 בצלים קלופים",
                    "4 שיני שום קלופות",
                    "1/2 פלפל צ'ילי אדום",
                    "4 כפות שמן קנולה, לטיגון"
                }
                ,
                PrepartionM = new List<string>()
                {
                    "מערבבים בקערה את רוטב הסויה עם מיץ התפוזים, הדבש והפלפל השחור.",
                    "חותכים את הבצלים לקוביות בגודל 1 ס'מ, פורסים את שיני השום לפרוסות דקות ואת הצ'ילי לפרוסות דקיקות.",
                    "מחממים את השמן מעל להבה בינונית בסיר רחב, מעבירים את השוקיים לסיר, משחימים אותם מכל צדיהן ומוציאים אותן בעזרת מלקחיים לקערה.",
                    "מוסיפים לסיר את הבצל ומאדים כדקה תוך כדי ערבוב. מוסיפים את פרוסות השום והצ'ילי ומבשלים כדקה נוספת.",
                    "מוספים לסיר את תערובת רוטב הסויה, מביאים את הרוטב לרתיחה, מנמיכים את הלהבה ומבשלים 5 דקות.",
                    "מחזירים את השוקיים לסיר, מכסים את הסיר ומבשלים מעל להבה בינונית במשך 25-30 דקות.",
                    "מעבירים את השוקיים לצלחת הגשה יחד עם הרוטב ומגישים חם."
                }
                ,
                LevelOfDifficul = 2,
                Time = 60,
                IfShow = true
            });
            R.Add(new Recipe()
            {
                CodeCategory = 1,
                CodeRecipe = 5,
                CodeUser = 456,
                DateAddRecipe = new DateTime(27 / 07 / 2020),
                NameRecipe = "עוף מוקפץ עם שעועית ירוקה",
                Image = "/assets/עוף מוקפץ.jpg",
                ListComponent = new List<string>()
                {
                    "400 גרם שעועית ירוקה שלמה עדינה מוקפאת",
                    "600 גרם חזה עוף, חתוך לרצועות",
                    "מלח",
                    "פלפל שחור גרוס",
                    "3 כפות שמן שומשום",
                    "3 כפות שמן קנולה או שמן סויה",
                    "1 כף ג'ינג'ר, מגורר גס",
                    "8 שיני שום, 4 פרוסות ו-4 כתושות",
                    "1 פלפל חריף, נקי מגרגירים וקצוץ",
                    "3 בצלים ירוקים, קצוצים",
                    "3 כפות דבש",
                    "6 כפות רוטב סויה",
                    "להגשה: חופן אגוזי פקאן קלויים, קצוצים גס",
                    "חופן אגוזי קשיו קלויים, קצוצים גס",
                    "2 כפות פטרוזיליה, קצוצה"

                }
                ,
                PrepartionM = new List<string>()
                {
                    "מבשלים את השעועית במים רותחים כ-4 דקות עד שהיא מתרככת מעט ומעבירים לקערת מי קרח ל-10 דקות. מסננים ומייבשים.",
                    "מתבלים את רצועות העוף במלח ופלפל. מחממים בווק את שני סוגי השמן, ומקפיצים את העוף בשני מחזורים כ-3 דקות, תוך ערבוב נמרץ, עד שהוא משנה את צבעו. מעבירים לצלחת.",
                    "מוסיפים למחבת את הג'ינג'ר, השום הפרוס והכתוש, הפלפל החריף והבצל הירוק ומקפיצים 3 דקות.",
                    "מחזירים למחבת את העוף, מוסיפים את השעועית הירוקה, הדבש ורוטב הסויה ומקפיצים עוד 3-2 דקות, עד שהעוף עשוי לחלוטין והרוטב עוטף היטב את כל המרכיבים. מגישים על אורז לבן, בעיטור האגוזים והפטרוזיליה הקצוצה."
                },
                LevelOfDifficul = 3,
                Time = 30,
                IfShow = true
            });

            R.Add(new Recipe()
            {
                CodeCategory = 1,
                CodeRecipe = 6,
                CodeUser = 789,
                DateAddRecipe = new DateTime(22 / 02 / 2020),
                NameRecipe = "ירקות מוקפצים עם טופו",
                Image = "/assets/ירקות מוקפצים עם טופו.jpg",
                ListComponent = new List<string>()
                {
                    "100 גרם טופו",
                    "1 גזר",
                    "1 פלפל אדום",
                    "2 גבעולי בצל ירוק",
                    "3 פטריות שמפיניון",
                    "קורט שומשום",
                    "1 שן שום",
                    "שמן קנולה",
                    "שמן שומשום",
                    "רוטב סויה",
                    "מלח ופלפל",
                    "2-3 כפות יין – לבן או אדום, תלוי מה יש בבית"
                },
                PrepartionM = new List<string>()
                {
                    "ערב לפני: חותכים את הטופו לקוביות ומשרים ביין.",
                    "ביום ההכנה: פורסים את השום ומקפיצים בשמן קנולה בווק. קוצצים את הגזר והפלפל לגפרורים.",
                    "מוסיפים את הגזר והפלפל לווק, מקפיצים 3 דקות.",
                    "פורסים את הפטריות והבצל ומוסיפים יחד עם הטופו לווק. מתבלים בשמן שומשום, סויה, מלח ופלפל ומקפיצים עוד 2-3 דקות.",
                    "מפזרים מעט שומשום ומגישים חם."
                }
               ,
                LevelOfDifficul = 3,
                Time = 20,
                IfShow = true
            });

            R.Add(new Recipe()
            {
                CodeCategory = 3,
                CodeRecipe = 7,
                CodeUser = 123,
                DateAddRecipe = new DateTime(01 / 07 / 2018),
                NameRecipe = "מעורב ירושלמי",
                Image = "/assets/מעורב ירושלמי.jpg",
                ListComponent = new List<string>()
                {
                    "2 בצלים",
                    "5 שיני שום",
                    "6 כפות שמן",
                    "300 גרם חזה עוף, חתוך לקוביות",
                    "150 גרם לבבות עוף, חצויים לשניים",
                    "200 גרם כבדי עוף מוכשרים, חתוך לרבעים",
                    "150 גרם טחולי עוף נקיים",
                    "1 כפית כמון",
                    "1 כפית מחוקה פפריקה מתוקה",
                    "1/4 כפית כורכום",
                    "קורט מלח",
                    "1 כפית מחוקה פלפל שחור גרוס",
                    "1 כף עמבה",
                    "2-3 גבעולי בצל ירוק",
                    "להגשה: 3-4 כפות (או כמה שאוהבים) טחינה",
                    "1 עגבניה",
                    "פיתות"
                },
                PrepartionM = new List<string>()
                {
                    " קוצצים את הבצלים והשום, ומטגנים עד להזהבה מלאה (מומלץ להוסיף את השום לקראת הסוף כדי שלא יישרף). מניחים בצד.",
                    " מחממים את שמן הזית במחבת, ומטגנים את הבשר (לפי הסדר הבא): חזה עוף, לבבות, כבדים וטחול.",
                    "מתבלים עם כמון, פפריקה, כורכום, מלח ופלפל שחור. מזלפים עוד קצת שמן זית.",
                    " מוסיפים את הבצל והשום המטוגנים ואת העמבה.",
                    "קוצצים את הבצל הירוק, ומוסיפים למחבת החמה.",
                    "מרכיבים את המנה: מסדרים את הטחינה בצלחת, מניחים מעל את המעורב הירושלמי, חותכים את העגבניה ומפזרים את ליבתה מעל ומזלפים מעט שמן זית. מגישים לצד פיתות."
                }
                ,
                LevelOfDifficul = 5,
                Time = 120,
                IfShow = true
            });
            R.Add(new Recipe()
            {
                CodeCategory = 3,
                CodeRecipe = 8,
                CodeUser = 456,
                DateAddRecipe = new DateTime(18 / 05 / 2019),
                NameRecipe = "פלאפל",
                Image = "/assets/פלאפל.jpg",
                ListComponent = new List<string>()
                {
                    "1 חבילה (800 גרם) חומוס קפוא סנפרוסט",
                    "5 שיני שום קלופות",
                    "1/2 כוס דחוסה פטרוזיליה קצוצה גס",
                    "1/2 כוס דחוסה כוסברה קצוצה גס",
                    "1/2 בצל גדול",
                    "1/2 כפית סודה לשתיה",
                    "1/2 כפית אבקת אפיה",
                    "1/2 - 1 כפית כמון",
                    "1/2 - 1 כפית זרעי כוסברה טחונים",
                    "1/2 פלפל ירוק חריף (לא הכרחי)",
                    "1 כפית גדושה מלח",
                    "1/3 כוס מים",
                    "1/3-1/2 כוס קמח",
                    "לטיגון: שמן",
                    "להגשה: סלט",
                    "סלט טחינה",
                    "פיתות",
                    "חמוצים"
                }
                ,
                PrepartionM = new List<string>()
                {
                    "שמים את כל הרכיבים למעט הקמח בקערת מעבד המזון ומעבדים בפולסים לתערובת גרגרית אחידה. מוסיפים 1/3 כוס קמח ומעבדים. אם התערובת רטובה מדי, מוסיפים עוד קצת קמח ומעבדים. התערובת צריכה להיות נוחה ליצירת כדורים.",
                    " מחממים שמן לטיגון עמוק. צרים מהעיסה כדורים קטנים ומכניסים לשמן החם. מטגנים 4-3 דקות עד שהכדורים זהובים־שחומים. מוציאים לצלחת מרופדת בנייר סופג. מגישים מיד עם סלט, טחינה, פיתות וחמוצים."
                }
                ,
                LevelOfDifficul = 2,
                Time = 40,
                IfShow = true
            });
            R.Add(new Recipe()
            {
                CodeCategory = 3,
                CodeRecipe = 9,
                CodeUser = 789,
                DateAddRecipe = new DateTime(17 / 10 / 2020),
                NameRecipe = "שקשוקה",
                Image = "/assets/שקשוקה.jpg",
                ListComponent = new List<string>()
                {
                    "בצל גדול קצוץ",
                    "4 עגבניות בינוניות חתוכות לקוביות (*רצוי להשתמש בעגבניות רכות)",
                    "1/2 גמבה חתוכה לקוביות",
                    "3-4  שיני שום כתושות",
                    "כף רסק עגבניות",
                    "4 ביצים",
                    "*לשקשוקה חריפה (לא חובה): פלפל חריף קצוץ או כפית פפריקה חריפה",
                    "תיבול: כפית גדושה פפריקה מתוקה, מלח, פלפל שחור לפי הטעם"
                }
                ,
                PrepartionM = new List<string>()
                {
                    "מחממים מחבת רחבה עם 1-2 כפות שמן ומטגנים את הבצל עד להזהבה קלה. מוסיפים את העגבניות, הגמבה, פלפל חריף ושום, ממליחים מעט ומבשלים עם מכסה מספר דקות עד שהגמבה מעט מתרככת (יש לערבב מדי פעם).",
                    "מוסיפים את הרסק ומתבלים במלח, פלפל ופפריקה. משאירים לעוד מספר דקות ומוסיפים את הביצים.",
                    "מכסים ומבשלים על אש נמוכה עד לקבלת דרגת העשייה הרצויה של הביצים."
                }
                ,
                LevelOfDifficul = 1,
                Time = 20,
                IfShow = true
                });

}
        public static int AddUser(User u)
        {
            
            Boolean b = DB.U.Any(t => t.CodeUser == u.CodeUser && t.Password.Equals(u.Password));
            if (b)
            {
              return  1;
            }
            else
            {

                    DB.U.Add(u);
                return  0;
            }   

            }


          public static int IsWorng(User u)
        {
            
        User user= DB.U.FirstOrDefault(x => x.NameUser == u.NameUser);
            if (user == null)
                return 2;
            if (user.NameUser == u.NameUser && u.Password == user.Password)
                return 1;
            if (user.NameUser == u.NameUser && u.Password != user.Password)
                return 0;
            return 2;
           
        }
                  
               public static List<Recipe> getRecipe()
        {
            return DB.R;
        }

        public static int AddRecipe(Recipe newR)
        {
            Boolean b = DB.R.Any(t => t.CodeRecipe == newR.CodeRecipe );
            
            
            if (b)
            {
                
                return 1;
            }
            else {
                DB.R.Add(newR);
                    return 0;
                }
          }

        public static void n(Recipe newR)
        {
          
            for (int i = 0; i < DB.R.Count; i++)
            {
                if (newR.CodeRecipe == DB.R[i].CodeRecipe)
                {
                    DB.R[i]=newR;
                }

            }
        }


        public static List<Category> getCategory()
        {
            return DB.C;
        }

        public static User GetUserById(int code)
        {
            return DB.U.FirstOrDefault((u) => u.CodeUser == code);
        }
    }

    }






           
                























            






    
